# Module 6 | Data Frame

### Creating a Data Frame

In [1]:
name <- c("Abu", "Ali", "Siti")
age <- c(20, 30, 20)

In [2]:
df <- data.frame(name, age)

In [3]:
df

  name age
1 Abu  20
2 Ali  30
3 Siti 20

In [4]:
df_with_name <- data.frame(Names = name, Age = age)

In [5]:
df_with_name

  Names Age
1 Abu   20
2 Ali   30
3 Siti  20

In [6]:
str(df)

'data.frame':	3 obs. of  2 variables:
 $ name: Factor w/ 3 levels "Abu","Ali","Siti": 1 2 3
 $ age : num  20 30 20

In [7]:
df_with_name <- data.frame(Names = name, Age = age, stringsAsFactors = FALSE)

In [8]:
df_with_name

  Names Age
1 Abu   20
2 Ali   30
3 Siti  20

In [9]:
str(df_with_name)

'data.frame':	3 obs. of  2 variables:
 $ Names: chr  "Abu" "Ali" "Siti"
 $ Age  : num  20 30 20

### Subset, extend and sort data frame

In [10]:
df[2, 2]

[1] 30

In [11]:
df[2]

  age
1 20
2 30
3 20

In [13]:
df["name"]

  name
1 Abu
2 Ali
3 Siti

In [14]:
df$age

[1] 20 30 20

In [19]:
height <- c(20, 20, 20)

In [20]:
df["height"] <- height

In [21]:
df

  name age height
1 Abu  20  20
2 Ali  30  20
3 Siti 20  20

In [22]:
sort(df$age)

[1] 20 20 30

In [23]:
ranks <- order(df$age)